README.md
```mermaid
graph LR
  linkStyle default fill:#ffffff

  subgraph diagram ["Digital Asset Distribution System - Content Distribution Backend - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    2("<div style='font-weight: bold'>A Digital Platform</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div>")
    style 2 fill:#dddddd,stroke:#9a9a9a,color:#000000
    15["<div style='font-weight: bold'>Asset Metadata Service</div><div style='font-size: 70%; margin-top: 0px'>[Container]</div>"]
    style 15 fill:#8cd0f0,stroke:#6291a8,color:#000000
    16["<div style='font-weight: bold'>Briefing Metadata Service</div><div style='font-size: 70%; margin-top: 0px'>[Container]</div>"]
    style 16 fill:#8cd0f0,stroke:#6291a8,color:#000000
    17[("<div style='font-weight: bold'>Redis</div><div style='font-size: 70%; margin-top: 0px'>[Container]</div><div style='font-size: 80%; margin-top:10px'>AssetDistributionMetadata<br />cache</div>")]
    style 17 fill:#bb1010,stroke:#820b0b,color:#000000

    subgraph 4 [Content Distribution Backend]
      style 4 fill:#ffffff,stroke:#6291a8,color:#6291a8

      10["<div style='font-weight: bold'>CachingAssetDistributionMetadataService</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div><div style='font-size: 80%; margin-top:10px'>A caching wrapper for<br />RestAssetDistributionMetadataService.</div>"]
      style 10 fill:#8cd0c0,stroke:#629186,color:#000000
      11["<div style='font-weight: bold'>RestAssetDistributionMetadataService</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div><div style='font-size: 80%; margin-top:10px'>Aggregates data about assets<br />into<br />AssetDistributionMetadata</div>"]
      style 11 fill:#8cd0c0,stroke:#629186,color:#000000
      5["<div style='font-weight: bold'>DefaultApiController</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div><div style='font-size: 80%; margin-top:10px'>A thin Rest controller.</div>"]
      style 5 fill:#8cd0c0,stroke:#629186,color:#000000
      9["<div style='font-weight: bold'>ContentDistributionMetadataService</div><div style='font-size: 70%; margin-top: 0px'>[Component]</div><div style='font-size: 80%; margin-top:10px'>Processes orders, creates<br />ContentDistributionMetadata.</div>"]
      style 9 fill:#8cd0c0,stroke:#629186,color:#000000
    end

    5-. "<div>Gets<br />ContentDistributionMetadata<br />from</div><div style='font-size: 70%'></div>" .->9
    9-. "<div>Gets<br />AssetDistributionMetadata<br />from</div><div style='font-size: 70%'></div>" .->10
    10-. "<div>Delegates to</div><div style='font-size: 70%'></div>" .->11
    11-. "<div>Gets AssetMetadata from</div><div style='font-size: 70%'></div>" .->15
    11-. "<div>Gets BriefingMetadata from</div><div style='font-size: 70%'></div>" .->16
    10-. "<div>Caches<br />AssetDistributionMetadata in</div><div style='font-size: 70%'></div>" .->17
    2-. "<div>Requests<br />AssetDistributionMetadata for<br />ordered assets from</div><div style='font-size: 70%'></div>" .->5
  end
```
